{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 32, "name": "conv2d_3", "dtype": "float32", "strides": [1, 1], "batch_input_shape": [null, 28, 28, 1], "kernel_regularizer": null, "padding": "valid"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 64, "name": "conv2d_4", "strides": [1, 1], "kernel_regularizer": null, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_2", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "seed": null, "noise_shape": null, "trainable": true, "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "dense_6", "units": 128, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "seed": null, "noise_shape": null, "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "kernel_constraint": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "dense_7", "units": 10, "kernel_regularizer": null}}], "keras_version": "2.1.6"}